#Использовать json

Перем ИмяФайлаНастроек;

Функция Конструктор_СтруктураПараметров(ЧитатьИмеющийсяКонфиг = Истина) Экспорт

	СтруктураПараметров = Новый Структура;
	СтруктураПараметров.Вставить("ПутьКСтволовомуХранилищу");

	Если ЧитатьИмеющийсяКонфиг Тогда
		СохраненныеПараметры = ПрочитатьПараметры();
		Для Каждого СохраненныйПараметр Из СохраненныеПараметры Цикл
			Если СтруктураПараметров.Свойство(СохраненныйПараметр.Ключ) <> Неопределено Тогда
				СтруктураПараметров[СохраненныйПараметр.Ключ] = СохраненныйПараметр.Значение;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
	Возврат СтруктураПараметров;

КонецФункции

Процедура СохранитьПараметры(СтруктураПараметров) Экспорт
	
	Парсер = Новый ПарсерJSON;
	JSON = Парсер.ЗаписатьJSON(СтруктураПараметров);
	
	ТекстовыйДокумент = Новый ТекстовыйДокумент();
	ТекстовыйДокумент.УстановитьТекст(JSON);
	ТекстовыйДокумент.Записать(ИмяФайлаНастроек, КодировкаТекста.UTF8NoBom);

КонецПроцедуры

Функция ПрочитатьПараметры() Экспорт
	
	ТекстовыйДокумент = Новый ТекстовыйДокумент;
	ТекстовыйДокумент.Прочитать(ИмяФайлаНастроек, КодировкаТекста.UTF8NoBom);
	JSON = ТекстовыйДокумент.ПолучитьТекст();

	Парсер = Новый ПарсерJSON;
	СтруктураПараметров = Парсер.ПрочитатьJSON(JSON);

	Возврат СтруктураПараметров;

КонецФункции

ИмяФайлаНастроек = ".1c-flow.config";